alplabai/alp-sdk/tests/zephyr/chips/src/test_gd32_bridge.c
ZTEST(alp_chips, test_gd32g553_init_gives_up_after_retry_budget)
{
	fake_gd32bridge_reset();
	/* Never stops being busy within any reasonable test budget --
	 * models the bootloader's watchdog-revert path, where no valid
	 * frame ever lands. */
	fake_gd32bridge_arm_busy_replies(1000000u);

	alp_i2c_t    *bus = open_fake_gd32bridge_bus();
	gd32g553_t    ctx;
	const int64_t start_ms   = k_uptime_get();
	alp_status_t  s          = gd32g553_init(&ctx, NULL, bus, 0x2Cu);
	const int64_t elapsed_ms = k_uptime_get() - start_ms;

	zassert_equal(s,
	              ALP_ERR_BUSY,
	              "init must give up with the last transient status once its budget is spent");
	zassert_false(ctx.initialised);
	/* Budget is 2 s, read ONCE via alp_uptime_ms() and shared across
	 * both the PING and GET_VERSION phases (#2314 review) -- allow
	 * slack below for scheduler jitter but prove it actually rode out
	 * most of the shared deadline rather than giving up early or
	 * doubling the budget by re-reading it per phase. */
	zassert_true(elapsed_ms >= 1500,
	             "init gave up too early (%lld ms) -- did the retry ladder regress?",
	             (long long)elapsed_ms);
	zassert_true(elapsed_ms < 2800,
	             "init overran the shared 2 s deadline (%lld ms) -- is the budget being "
	             "re-read per phase instead of shared?",
	             (long long)elapsed_ms);

	alp_i2c_close(bus);
	fake_gd32bridge_reset();
}

ZTEST(alp_chips, test_gd32g553_init_non_transient_wire_status_not_retried)
{
	fake_gd32bridge_reset();
	/* A non-transient wire status on the very first PING (no BUSY ever
	 * seen) must break out of the retry loop immediately -- exercises
	 * the loop's OWN transience check, distinct from the post-loop
	 * major-version check the next test covers. */
	fake_gd32bridge_arm_status_replies(FAKE_GD32BRIDGE_WIRE_STATUS_NOSUPPORT, 1u);

	alp_i2c_t *bus = open_fake_gd32bridge_bus();
	gd32g553_t ctx;
	zassert_equal(gd32g553_init(&ctx, NULL, bus, 0x2Cu),
	              ALP_ERR_NOSUPPORT,
	              "a non-transient wire status must return immediately, not retry");
	zassert_equal(fake_gd32bridge_calls_seen(), 1u, "exactly one PING -- no retry engaged");

	alp_i2c_close(bus);
	fake_gd32bridge_reset();
}

ZTEST(alp_chips, test_gd32g553_init_non_transient_error_not_retried)
{
	fake_gd32bridge_reset();
	/* A genuine major-version mismatch is not transient -- GET_VERSION
	 * itself succeeds (STATUS_OK), it's the version check afterward
	 * that fails, and that must return immediately. */
	fake_gd32bridge_set_version((uint8_t)(GD32G553_HOST_PROTOCOL_MAJOR + 1u), 0u, 0u);

	alp_i2c_t *bus = open_fake_gd32bridge_bus();
	gd32g553_t ctx;
	zassert_equal(gd32g553_init(&ctx, NULL, bus, 0x2Cu),
	              ALP_ERR_NOSUPPORT,
	              "a genuine version mismatch must return immediately, not retry");
	zassert_equal(fake_gd32bridge_calls_seen(),
	              2u,
	              "exactly one PING + one GET_VERSION -- no retry ladder engaged");

	alp_i2c_close(bus);
	fake_gd32bridge_reset();
}

ZTEST(alp_chips, test_gd32g553_post_init_calls_reject_uninitialised)
{
	gd32g553_t ctx = { 0 };
	zassert_equal(gd32g553_set_default_transport(&ctx, GD32G553_TRANSPORT_SPI), ALP_ERR_NOT_READY);

	uint32_t levels;
	zassert_equal(gd32g553_gpio_read(&ctx, 0u, &levels), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_gpio_write(&ctx, 0u, 0u), ALP_ERR_NOT_READY);

	uint8_t pmic = 0u;
	zassert_equal(gd32g553_da9292_status_forward(&ctx, &pmic), ALP_ERR_NOT_READY);

	/* v0.2 wrappers must obey the same NOT_READY contract. */
	uint16_t mv    = 0u;
	int32_t  pos   = 0;
	uint32_t ticks = 0u;
	zassert_equal(gd32g553_dac_set(&ctx, 0u, 0u), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_dac_get(&ctx, 0u, &mv), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_qenc_read(&ctx, 0u, &pos), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_qenc_reset(&ctx, 0u), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_counter_read(&ctx, 0u, &ticks), ALP_ERR_NOT_READY);
}

ZTEST(alp_chips, test_gd32g553_pwm_set_invalid_duty)
{
	gd32g553_t ctx = { .initialised = true };
	zassert_equal(gd32g553_pwm_set(&ctx, 0u, 100000u, 200000u), ALP_ERR_INVAL);
}

ZTEST(alp_chips, test_gd32g553_adc_read_invalid_samples)
{
	gd32g553_t ctx = { .initialised = true };
	uint16_t   mv[16];

	zassert_equal(gd32g553_adc_read(&ctx, 0u, 0u, mv), ALP_ERR_INVAL);
	zassert_equal(gd32g553_adc_read(&ctx, 0u, GD32G553_BRIDGE_ADC_MAX_SAMPLES + 1u, mv),
	              ALP_ERR_INVAL);
	zassert_equal(gd32g553_adc_read(&ctx, 0u, 1u, NULL), ALP_ERR_INVAL);
}

ZTEST(alp_chips, test_gd32g553_v02_invalid_args)
{
	/* Range + NULL-arg validation on the v0.2 wrappers happens before
     * any transport call so it's safe to assert against an
     * `initialised=true` stub context with no real bus handles. */
	gd32g553_t ctx   = { .initialised = true };
	uint16_t   mv    = 0u;
	int32_t    pos   = 0;
	uint32_t   ticks = 0u;

	/* DAC: channel out of range rejects, NULL out-pointer on DAC_GET rejects. */
	zassert_equal(gd32g553_dac_set(&ctx, GD32G553_BRIDGE_DAC_CHANNELS, 1650u), ALP_ERR_INVAL);
	zassert_equal(gd32g553_dac_get(&ctx, 0u, NULL), ALP_ERR_INVAL);
	zassert_equal(gd32g553_dac_get(&ctx, GD32G553_BRIDGE_DAC_CHANNELS, &mv), ALP_ERR_INVAL);

	/* QENC: encoder out of range rejects, NULL out-pointer on QENC_READ rejects. */
	zassert_equal(gd32g553_qenc_read(&ctx, 0u, NULL), ALP_ERR_INVAL);
	zassert_equal(gd32g553_qenc_read(&ctx, GD32G553_BRIDGE_QENC_CHANNELS, &pos), ALP_ERR_INVAL);
	zassert_equal(gd32g553_qenc_reset(&ctx, GD32G553_BRIDGE_QENC_CHANNELS), ALP_ERR_INVAL);

	/* COUNTER: counter out of range rejects, NULL out-pointer rejects. */
	zassert_equal(gd32g553_counter_read(&ctx, 0u, NULL), ALP_ERR_INVAL);
	zassert_equal(gd32g553_counter_read(&ctx, GD32G553_BRIDGE_COUNTER_CHANNELS, &ticks),
	              ALP_ERR_INVAL);
}

/* ------------------------------------------------------------------ */
/* gd32_swd -- bit-bang SWD controller (host-side)                    */
/*                                                                    */
/* No real GPIO emul can drive the SWD protocol -- the bits hit the   */
/* wire faster than gpio_emul can latch state.  These tests cover the */
/* argument-validation surface + the uninitialised post-init paths.   */
/* ------------------------------------------------------------------ */

