alplabai/alp-sdk/tests/zephyr/chips/src/test_gd32_bridge.c
ZTEST(alp_chips, test_gd32_swd_init_null_args)
{
	gd32_swd_t  ctx;
	alp_gpio_t *bogus = (alp_gpio_t *)0xDEADBEEFu;

	/* NULL ctx -> INVAL.  Even with non-NULL pin handles. */
	zassert_equal(gd32_swd_init(NULL, bogus, bogus, NULL), ALP_ERR_INVAL);
	/* NULL swdio -> INVAL. */
	zassert_equal(gd32_swd_init(&ctx, NULL, bogus, NULL), ALP_ERR_INVAL);
	/* NULL swclk -> INVAL. */
	zassert_equal(gd32_swd_init(&ctx, bogus, NULL, NULL), ALP_ERR_INVAL);
	/* NULL nrst is allowed (boards that don't route it work via
     * AIRCR.SYSRESETREQ).  Not asserted here -- the gpio_emul-backed
     * init would still try alp_gpio_configure on the two bogus
     * pointers, which is not a contract this layer tests. */
}

ZTEST(alp_chips, test_gd32_swd_calls_reject_uninitialised)
{
	gd32_swd_t ctx = { 0 };

	/* Every post-init helper must report NOT_READY rather than
     * dereferencing NULL swdio / swclk on a zeroed context. */
	zassert_equal(gd32_swd_set_clock_delay(&ctx, 4u), ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_connect(&ctx), ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_halt(&ctx), ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_flash_erase(&ctx, GD32_SWD_FMC_FLASH_BASE, 4096u), ALP_ERR_NOT_READY);
	uint8_t buf[8] = { 0 };
	zassert_equal(gd32_swd_flash_write(&ctx, GD32_SWD_FMC_FLASH_BASE, buf, sizeof buf),
	              ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_flash_verify(&ctx, GD32_SWD_FMC_FLASH_BASE, buf, sizeof buf),
	              ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_reset_and_run(&ctx), ALP_ERR_NOT_READY);

	/* deinit must be safe on a zero context + on NULL. */
	gd32_swd_deinit(&ctx);
	gd32_swd_deinit(NULL);
}

ZTEST(alp_chips, test_gd32_swd_flash_helpers_reject_unconnected)
{
	/* .initialised but not .connected -- erase / write / verify
     * call gd32_swd_connect()'s outcome.  These should still report
     * NOT_READY because the SW-DP hasn't been brought up. */
	gd32_swd_t ctx    = { .initialised = true };
	uint8_t    buf[8] = { 0 };

	zassert_equal(gd32_swd_halt(&ctx), ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_flash_erase(&ctx, GD32_SWD_FMC_FLASH_BASE, 4096u), ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_flash_write(&ctx, GD32_SWD_FMC_FLASH_BASE, buf, sizeof buf),
	              ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_flash_verify(&ctx, GD32_SWD_FMC_FLASH_BASE, buf, sizeof buf),
	              ALP_ERR_NOT_READY);
}

ZTEST(alp_chips, test_gd32_swd_flash_arg_validation)
{
	/* .connected = true so the function reaches the argument-check
     * branch before bus access. */
	gd32_swd_t     ctx       = { .initialised = true, .connected = true };
	uint8_t        buf[8]    = { 0 };
	const uint32_t flash_end = GD32_SWD_FMC_FLASH_BASE + 512u * 1024u;

	/* size == 0 -> INVAL. */
	zassert_equal(gd32_swd_flash_erase(&ctx, GD32_SWD_FMC_FLASH_BASE, 0u), ALP_ERR_INVAL);
	/* addr below flash base -> INVAL. */
	zassert_equal(gd32_swd_flash_erase(&ctx, 0x00000000u, 4096u), ALP_ERR_INVAL);
	/* Flash range checks reject exact-end, past-end, and wrapped
     * ranges before any FMC unlock/program/read operation. */
	zassert_equal(gd32_swd_flash_erase(&ctx, flash_end, 1u), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_erase(&ctx, flash_end - 1u, 2u), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_erase(&ctx, UINT32_MAX - 1u, 4u), ALP_ERR_INVAL);

	/* NULL data / zero len -> INVAL on write + verify. */
	zassert_equal(gd32_swd_flash_write(&ctx, GD32_SWD_FMC_FLASH_BASE, NULL, 8u), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_write(&ctx, GD32_SWD_FMC_FLASH_BASE, buf, 0u), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_verify(&ctx, GD32_SWD_FMC_FLASH_BASE, NULL, 8u), ALP_ERR_INVAL);

	/* Misaligned addr -> INVAL.  Write requires doubleword (8-byte)
     * alignment; verify requires word (4-byte) alignment. */
	zassert_equal(gd32_swd_flash_write(&ctx, GD32_SWD_FMC_FLASH_BASE + 1u, buf, sizeof buf),
	              ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_verify(&ctx, GD32_SWD_FMC_FLASH_BASE + 1u, buf, sizeof buf),
	              ALP_ERR_INVAL);

	/* Aligned addresses that fall outside the 512 KiB flash window
     * must be rejected as ranges, not passed through to the SWD bus. */
	zassert_equal(gd32_swd_flash_write(&ctx, flash_end, buf, sizeof buf), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_write(&ctx, flash_end - 8u, buf, sizeof buf + 1u), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_write(&ctx, UINT32_MAX - 7u, buf, sizeof buf), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_write(&ctx, GD32_SWD_FMC_FLASH_BASE, buf, SIZE_MAX),
	              ALP_ERR_INVAL);

	zassert_equal(gd32_swd_flash_verify(&ctx, flash_end, buf, sizeof buf), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_verify(&ctx, flash_end - 4u, buf, sizeof buf), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_verify(&ctx, UINT32_MAX - 3u, buf, sizeof buf), ALP_ERR_INVAL);
	zassert_equal(gd32_swd_flash_verify(&ctx, GD32_SWD_FMC_FLASH_BASE, buf, SIZE_MAX),
	              ALP_ERR_INVAL);
}

ZTEST(alp_chips, test_gd32_swd_clock_delay_clamp)
{
	/* set_clock_delay clamps to [0, 2048].  We can't read the
     * private field, but the contract is that the call accepts any
     * value (no INVAL) and only NOT_READY when uninit -- exercise
     * the latter only here. */
	gd32_swd_t ctx = { 0 };
	zassert_equal(gd32_swd_set_clock_delay(&ctx, 0u), ALP_ERR_NOT_READY);
	zassert_equal(gd32_swd_set_clock_delay(&ctx, 100000u), ALP_ERR_NOT_READY);

	/* Once initialised the call returns OK even for an out-of-range
     * value (internally clamped). */
	ctx.initialised = true;
	zassert_equal(gd32_swd_set_clock_delay(&ctx, 100000u),
	              ALP_OK,
	              "delay 100000 must clamp + return OK, not INVAL");
}

/* ------------------------------------------------------------------ */
/* GD32G553 v0.5 host helpers (§2B.2 + §2B.3 + Task #10) -- NOT_READY  */
/* + INVAL contracts against an uninitialised ctx.  Wire-side          */
/* behaviour validates against the firmware HAL bodies in HW-in-loop. */
/* ------------------------------------------------------------------ */

