alplabai/alp-sdk/tests/zephyr/chips/src/test_gd32_bridge.c
ZTEST(alp_chips, test_gd32g553_v05_calls_reject_uninitialised)
{
	gd32g553_t ctx       = { 0 };
	uint32_t   period_ns = 0u;
	uint32_t   pulse_ns  = 0u;
	uint8_t    chain_id  = 0u;

	/* Every v0.5 host helper must reject an uninitialised ctx with
     * NOT_READY -- the standard chip-driver lifecycle contract.
     * Real wire dispatch only happens after gd32g553_init() flips
     * ctx.initialised; until then the helpers short-circuit. */
	zassert_equal(gd32g553_pwm_capture_begin(&ctx, 0u, 0u), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_pwm_capture_read(&ctx, 0u, &period_ns, &pulse_ns), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_pwm_capture_end(&ctx, 0u), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_pwm_single_pulse(&ctx, 0u, 1000u), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_timer_sync(&ctx, 0u, 1u, 0u), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_power_mode_set(&ctx, 1u, 0u, 0u), ALP_ERR_NOT_READY);
	/* §2B wave-2 chunked DSP-chain upload helpers honour the same
     * NOT_READY contract -- chain_open, stage_push, chain_bind all
     * short-circuit before serialising the wire envelope. */
	zassert_equal(gd32g553_adc_dsp_chain_open(&ctx, &chain_id), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_adc_dsp_stage_push(&ctx, 0u, 0u, 0u, NULL, 0u), ALP_ERR_NOT_READY);
	zassert_equal(gd32g553_adc_dsp_chain_bind(&ctx, 0u, 0u), ALP_ERR_NOT_READY);
	/* spectrum_read (#496) honours the same NOT_READY short-circuit. */
	uint32_t sp_seq;
	uint16_t sp_total;
	uint8_t  sp_got;
	float    sp_bins[4];
	zassert_equal(
	    gd32g553_adc_spectrum_read(&ctx, 0u, 0u, 1u, &sp_seq, &sp_total, &sp_got, sp_bins),
	    ALP_ERR_NOT_READY);
}

ZTEST(alp_chips, test_gd32g553_v05_invalid_args)
{
	gd32g553_t ctx = { .initialised = true };

	/* pwm_capture_begin rejects edge > 2 (i.e. outside RISING /
     * FALLING / BOTH). */
	zassert_equal(gd32g553_pwm_capture_begin(&ctx, 0u, 3u), ALP_ERR_INVAL);
	zassert_equal(gd32g553_pwm_capture_begin(&ctx, 0u, 99u), ALP_ERR_INVAL);

	/* pwm_capture_read rejects both NULL out-params (caller wants
     * something out of the call). */
	zassert_equal(gd32g553_pwm_capture_read(&ctx, 0u, NULL, NULL), ALP_ERR_INVAL);

	/* pwm_single_pulse rejects pulse_ns == 0 (zero-width pulse
     * is meaningless and likely caller error). */
	zassert_equal(gd32g553_pwm_single_pulse(&ctx, 0u, 0u), ALP_ERR_INVAL);

	/* power_mode_set rejects mode > 3 (outside RUN / SLEEP /
     * DEEP_SLEEP / STANDBY). */
	zassert_equal(gd32g553_power_mode_set(&ctx, 4u, 0u, 0u), ALP_ERR_INVAL);
	zassert_equal(gd32g553_power_mode_set(&ctx, 99u, 0u, 0u), ALP_ERR_INVAL);

	/* §2B wave-2 DSP-chain helpers reject malformed args before they
     * hit cmd_send.  Each constraint mirrors the firmware-side
     * decoder's expectations so callers don't waste a wire trip to
     * surface obvious typos. */
	/* chain_open rejects NULL out-param (caller can't observe the
     * assigned chain_id without it). */
	zassert_equal(gd32g553_adc_dsp_chain_open(&ctx, NULL), ALP_ERR_INVAL);

	/* stage_push rejects stage_index outside [0, MAX_STAGES). */
	zassert_equal(
	    gd32g553_adc_dsp_stage_push(&ctx, 0u, GD32G553_BRIDGE_ADC_DSP_MAX_STAGES, 0u, NULL, 0u),
	    ALP_ERR_INVAL);
	zassert_equal(gd32g553_adc_dsp_stage_push(&ctx, 0u, 99u, 0u, NULL, 0u), ALP_ERR_INVAL);
	/* stage_push rejects kind > 3 (outside FIR/IIR/WINDOW/FFT). */
	zassert_equal(gd32g553_adc_dsp_stage_push(&ctx, 0u, 0u, 4u, NULL, 0u), ALP_ERR_INVAL);
	zassert_equal(gd32g553_adc_dsp_stage_push(&ctx, 0u, 0u, 99u, NULL, 0u), ALP_ERR_INVAL);
	/* stage_push rejects NULL params when len > 0 (caller asked to
     * upload bytes from a NULL pointer). */
	zassert_equal(gd32g553_adc_dsp_stage_push(&ctx, 0u, 0u, 0u, NULL, 4u), ALP_ERR_INVAL);
	/* stage_push rejects oversized payload (would overrun the
     * firmware's per-stage buffer). */
	{
		static const uint8_t oversized[GD32G553_BRIDGE_ADC_DSP_MAX_STAGE_BYTES + 4u] = { 0 };
		zassert_equal(
		    gd32g553_adc_dsp_stage_push(&ctx, 0u, 0u, 0u, oversized, (uint16_t)sizeof(oversized)),
		    ALP_ERR_OUT_OF_RANGE);
	}

	/* chain_bind rejects stream_id outside [0, ADC_STREAM_COUNT). */
	zassert_equal(gd32g553_adc_dsp_chain_bind(&ctx, 0u, GD32G553_BRIDGE_ADC_STREAM_COUNT),
	              ALP_ERR_INVAL);
	zassert_equal(gd32g553_adc_dsp_chain_bind(&ctx, 0u, 99u), ALP_ERR_INVAL);

	/* spectrum_read (#496) rejects NULL out-params, max_bins == 0, and
	 * an out-of-range stream_id before it serialises a wire request. */
	{
		uint32_t seq;
		uint16_t total;
		uint8_t  got;
		float    bins[4];
		zassert_equal(gd32g553_adc_spectrum_read(&ctx, 0u, 0u, 1u, NULL, &total, &got, bins),
		              ALP_ERR_INVAL);
		zassert_equal(gd32g553_adc_spectrum_read(&ctx, 0u, 0u, 1u, &seq, &total, &got, NULL),
		              ALP_ERR_INVAL);
		zassert_equal(gd32g553_adc_spectrum_read(&ctx, 0u, 0u, 0u, &seq, &total, &got, bins),
		              ALP_ERR_INVAL);
		zassert_equal(gd32g553_adc_spectrum_read(
		                  &ctx, GD32G553_BRIDGE_ADC_STREAM_COUNT, 0u, 1u, &seq, &total, &got, bins),
		              ALP_ERR_INVAL);
	}
}

/* ------------------------------------------------------------------ */
/* #751 -- OTA protocol-minor gate                                     */
/* ------------------------------------------------------------------ */

ZTEST(alp_chips, test_gd32g553_ota_supported_gate)
{
	/* NULL / uninitialised are never OTA-capable. */
	zassert_false(gd32g553_ota_supported(NULL), "NULL ctx must not be OTA-capable");
	gd32g553_t uninit = { 0 };
	zassert_false(gd32g553_ota_supported(&uninit), "uninitialised ctx must not be OTA-capable");

	/* v0.5 peer: the chunk wire format predates the length byte, so the
	 * host refuses -- a v0.6 host driving v0.5 firmware would otherwise
	 * program the length byte into the image (#751). */
	gd32g553_t v05 = { .initialised = true, .version = { .major = 0u, .minor = 5u, .patch = 0u } };
	zassert_false(gd32g553_ota_supported(&v05), "v0.5 peer must be rejected");

	/* v0.6 peer: first minor that carries the explicit chunk length. */
	gd32g553_t v06 = { .initialised = true, .version = { .major = 0u, .minor = 6u, .patch = 0u } };
	zassert_true(gd32g553_ota_supported(&v06), "v0.6 peer must be accepted");

	/* Current host minor (>= 6) is accepted too. */
	gd32g553_t vcur = {
		.initialised = true,
		.version     = { .major = 0u, .minor = GD32G553_OTA_MIN_PROTOCOL_MINOR + 3u, .patch = 0u }
	};
	zassert_true(gd32g553_ota_supported(&vcur), "current-minor peer must be accepted");
}

ZTEST(alp_chips, test_gd32g553_ota_ops_reject_pre_v06_peer)
{
	/* An initialised-but-v0.5 ctx must have its flash-touching OTA ops
	 * short-circuit with NOSUPPORT -- BEFORE any erase/program.  The gate
	 * sits after arg validation, so pass otherwise-valid arguments. */
	gd32g553_t v05 = { .initialised = true, .version = { .major = 0u, .minor = 5u, .patch = 0u } };

	uint16_t            chunk_max = 0u;
	gd32g553_ota_slot_t slot      = (gd32g553_ota_slot_t)0;
	zassert_equal(gd32g553_ota_begin(&v05, 4096u, 0xdeadbeefu, NULL, &chunk_max, &slot),
	              ALP_ERR_NOSUPPORT,
	              "ota_begin must refuse a v0.5 peer");

	const uint8_t data[4] = { 1u, 2u, 3u, 4u };
	uint32_t      rx      = 0u;
	zassert_equal(gd32g553_ota_write_chunk(&v05, 0u, data, sizeof(data), &rx),
	              ALP_ERR_NOSUPPORT,
	              "ota_write_chunk must refuse a v0.5 peer");
}

